In [2]:
import pandas as pd

In [5]:
data = [1,2,3,4,5]

series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [8]:
data1 = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data1)
print(series_dict)
print(type(series_dict))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [12]:
data2 = [10,20,30]

index1 = ['a','b','c']

series_custom = pd.Series(data2, index=index1)

print(series_custom)

a    10
b    20
c    30
dtype: int64

In [97]:
data = {
    'name': ['krish','kevin','jack'],
    'age': [25, 30, 45],
    'city':['bangalore','new york','florida']
}

df = pd.DataFrame(data)
print(df)

    name  age       city
0  krish   25  bangalore
1  kevin   30   new york
2   jack   45    florida

In [98]:
data = [
    {"name":"Thameem",'age':20,'place':'India'},
    {"name":"kevin",'age':25,'place':'Uk'},
    {"name":"anvar",'age':30,'place':'India'},
    {"name":"peter",'age':18,'place':'Spain'}
]

dt = pd.DataFrame(data)
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

## Reading Data from CSV file

In [22]:
df = pd.read_csv("sales_data.csv")
print(df.head())

                              Region                Country        Item Type  \
0              Australia and Oceania                 Tuvalu        Baby Food
1  Central America and the Caribbean                Grenada           Cereal
2                             Europe                 Russia  Office Supplies
3                 Sub-Saharan Africa  Sao Tome and Principe           Fruits
4                 Sub-Saharan Africa                 Rwanda  Office Supplies

  Sales Channel Order Priority Order Date   Order ID  Ship Date  Units Sold  \
0       Offline              H  5/28/2010  669165933  6/27/2010        9925
1        Online              C  8/22/2012  963881480  9/15/2012        2804
2       Offline              L   5/2/2014  341417157   5/8/2014        1779
3        Online              C  6/20/2014  514321792   7/5/2014        8102
4       Offline              L   2/1/2013  115456712   2/6/2013        5062

   Unit Price  Unit Cost  Total Revenue  Total Cost  Total Profit
0      255.28     159.42     2533654.00  1582243.50     951410.50
1      205.70     117.11      576782.80   328376.44     248406.36
2      651.21     524.96     1158502.59   933903.84     224598.75
3        9.33       6.92       75591.66    56065.84      19525.82
4      651.21     524.96     3296425.02  2657347.52     639077.50

## Accessing Data in DataFrame

In [25]:
df['Region']

0                 Australia and Oceania
1     Central America and the Caribbean
2                                Europe
3                    Sub-Saharan Africa
4                    Sub-Saharan Africa
                    ...
95                   Sub-Saharan Africa
96                                 Asia
97                   Sub-Saharan Africa
98                        North America
99                   Sub-Saharan Africa
Name: Region, Length: 100, dtype: object

In [28]:
df.loc[0]

Region            Australia and Oceania
Country                          Tuvalu
Item Type                     Baby Food
Sales Channel                   Offline
Order Priority                        H
Order Date                    5/28/2010
Order ID                      669165933
Ship Date                     6/27/2010
Units Sold                         9925
Unit Price                       255.28
Unit Cost                        159.42
Total Revenue                 2533654.0
Total Cost                    1582243.5
Total Profit                   951410.5
Name: 0, dtype: object

In [33]:
df.loc[1]

Region            Central America and the Caribbean
Country                                     Grenada
Item Type                                    Cereal
Sales Channel                                Online
Order Priority                                    C
Order Date                                8/22/2012
Order ID                                  963881480
Ship Date                                 9/15/2012
Units Sold                                     2804
Unit Price                                    205.7
Unit Cost                                    117.11
Total Revenue                              576782.8
Total Cost                                328376.44
Total Profit                              248406.36
Name: 1, dtype: object

In [40]:
df.iloc[0,0]

'Australia and Oceania'

In [42]:
df.iloc[1,2]

'Cereal'

In [47]:
df.at[1, 'Region']

'Central America and the Caribbean'

In [49]:
df.at[2, 'Item Type']

'Office Supplies'

In [51]:
df.iat[2, 2]

'Office Supplies'

In [52]:
df.iat[2, 3]

'Offline'

## Data Manipulatio with DataFrame

In [56]:
df['Unit Price']

0     255.28
1     205.70
2     651.21
3       9.33
4     651.21
       ...
95    109.28
96      9.33
97    154.06
98     81.73
99    668.27
Name: Unit Price, Length: 100, dtype: float64

In [99]:
dt

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

In [100]:
dt['projects'] = [58, 77, 22, 14]

print(dt)

      name  age  place  projects
0  Thameem   20  India        58
1    kevin   25     Uk        77
2    anvar   30  India        22
3    peter   18  Spain        14

In [101]:
dt.drop('projects', axis=1, inplace=True)
print(dt)

      name  age  place
0  Thameem   20  India
1    kevin   25     Uk
2    anvar   30  India
3    peter   18  Spain

In [102]:
dt['age'] = dt['age'] + 1
dt

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India
3    peter   19  Spain

In [103]:
dt.drop(3, inplace=True)
print(dt)

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India

## DataFrame attributes and methods

In [106]:
print(dt.head())
print(dt.dtypes)
print(dt.describe())

      name  age  place
0  Thameem   21  India
1    kevin   26     Uk
2    anvar   31  India
name     object
age       int64
place    object
dtype: object
        age
count   3.0
mean   26.0
std     5.0
min    21.0
25%    23.5
50%    26.0
75%    28.5
max    31.0